Tekla Open API Reference for Tekla Structures 2025
ModelHistory.GetCurrentModificationStamp Method
Note: This API is now obsolete.
 Gets the current modification stamp from the model.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Use TakeModifications() instead.")]
public static ModificationStamp GetCurrentModificationStamp()
<ObsoleteAttribute("Use TakeModifications() instead.")>
Public Shared Function GetCurrentModificationStamp As ModificationStamp
Return Value
Type: ModificationStamp
The current modification stamp.
See Also
Reference
ModelHistory Class
Tekla.Structures.Model.History Namespace